---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.NonContinuousRailStructure
source: html/a48aa02e-5559-bac9-f990-944c165acee4.htm
---
# NonContinuousRailStructure Methods

Creates and appends a new Non-Continuous Rail to the Rail Structure.
 The new Non-Continuous Rail will have the given name, height and offset.
 It will have default profile and material ElementIds.